{
  "description": "Skilled Force-users can learn to manipulate their Force Powers in intriguing ways. Force Secrets represent a sublime connection to The Force and are usually available only to powerful Force-users such as Force Disciples, Jedi Masters, and Sith Lords.",
  "notes": "Activating a Force Secret costs either a Force Point or a Destiny Point (as noted in its description), and the normal limits on spending Force Points and Destiny Points during a round apply. Whenever you learn a new Force Secret, select it from the list below. Once selected, a Force Secret cannot be changed.",
  "secrets": [
    {
      "name": "Devastating Power",
      "source": "Core",
      "cost": "Force Point or Destiny Point",
      "description": "Allows you to maximize the damage or effect of a Force Power.",
      "prerequisites": []
    },
    {
      "name": "Distant Power",
      "source": "Core",
      "cost": "Force Point or Destiny Point",
      "description": "Allows you to extend the range of a Force Power.",
      "prerequisites": []
    },
    {
      "name": "Multitarget Power",
      "source": "Core",
      "cost": "Force Point or Destiny Point",
      "description": "Allows you to affect multiple targets with a single-target Force Power.",
      "prerequisites": []
    },
    {
      "name": "Quicken Power",
      "source": "Core",
      "cost": "Force Point or Destiny Point",
      "description": "Allows you to activate a Force Power as a Swift Action instead of its normal action type.",
      "prerequisites": []
    },
    {
      "name": "Shaped Power",
      "source": "Core",
      "cost": "Force Point or Destiny Point",
      "description": "Allows you to shape the area of effect of a Force Power to exclude allies.",
      "prerequisites": []
    },
    {
      "name": "Corrupted Power",
      "source": "Force Unleashed Campaign Guide",
      "cost": "Force Point or Destiny Point",
      "description": "When you activate a Force Power, you can spend a Force Point to corrupt the Force Power. The Force Power gains the [Dark Side] descriptor, and opponents who have a Dark Side Score lower than yours take a -2 penalty to all Defense Scores against this activation of the Force Power.",
      "alternativeCost": "Alternatively, you can spend a Destiny Point to increase the penalty to opponents' Defense Scores to -5.",
      "prerequisites": [],
      "special": "You cannot use this Force Secret unless your Dark Side Score equals your Wisdom score. Force Powers that have the [Light Side] descriptor cannot be corrupted by the use of this Force Secret."
    },
    {
      "name": "Debilitating Power",
      "source": "Force Unleashed Campaign Guide",
      "cost": "Force Point or Destiny Point",
      "description": "When you use a Force Power that successfully deals damage to the target, you can spend a Force Point to move the target -1 step along the Condition Track (in addition to any movement along the Condition Track imposed by the Force Power normally) provided your Use the Force check equals or exceeds the target's Damage Threshold.",
      "alternativeCost": "Alternatively, you can spend a Destiny Point to move the target -3 steps along the Condition Track.",
      "prerequisites": []
    },
    {
      "name": "Enlarged Power",
      "source": "Force Unleashed Campaign Guide",
      "cost": "Force Point or Destiny Point",
      "description": "When you use a Force Power that affects targets within an area (such as a radius or a cone), you can spend a Force Point to double the distance that the effect extends from your square (for example, a 6-square cone can be made into a 12-square cone).",
      "alternativeCost": "Alternatively, you can spend a Destiny Point to multiply the distance the effect extends by 5 (making a 6-square cone into a 30-square cone).",
      "prerequisites": []
    },
    {
      "name": "Pure Power",
      "source": "Force Unleashed Campaign Guide",
      "cost": "Force Point or Destiny Point",
      "description": "When you use a Force Power, you can spend a Force Point to purify the Force Power. The Force Power gains the [Light Side] descriptor, and opponents who have a Dark Side Score of 1 or higher take a -2 penalty to all Defense Scores against this activation of the Force Power.",
      "alternativeCost": "Alternatively, you can spend a Destiny Point to increase the penalty to opponents' Defense Scores to -5.",
      "prerequisites": [],
      "special": "You cannot use this Force Secret if you have a Dark Side Score of 1 or higher. Force Powers that have the [Dark Side] descriptor cannot be purified with this Force Secret."
    },
    {
      "name": "Remote Power",
      "source": "Force Unleashed Campaign Guide",
      "cost": "Force Point or Destiny Point",
      "description": "When you use a Force Power that has a Cone, line, or radius effect that originates from your square, you can spend a Force Point to have the Force Power originate from a square within 6 squares of you.",
      "alternativeCost": "Alternatively, you can spend a Destiny Point to have the Force Power originate from any square within your line of sight.",
      "prerequisites": [],
      "special": "You still choose the direction of the Force Power as though you were standing in the chosen square."
    },
    {
      "name": "Extend Power",
      "source": "Clone Wars Campaign Guide",
      "cost": "Force Point",
      "description": "When using a Force Power that allows you to maintain your concentration (such as Force Grip), you can spend a Force Point to sustain the Force Power as a Swift Action instead of a Standard Action for a number of rounds equal to your Charisma modifier.",
      "prerequisites": []
    },
    {
      "name": "Linked Power",
      "source": "Clone Wars Campaign Guide",
      "cost": "Force Point",
      "description": "You can spend a Force Point to link a Force Power to the Force Power you use in the current round so that it goes off in the following round. You must choose two Force Powers - one for the current and one for the next round. Both selected Force Powers cannot be altered in any way, such as through Force Techniques, Force Secrets, or the use of Force Points. However, the second Force Power goes off in the following round as a Free Action at the start of your turn.",
      "prerequisites": []
    },
    {
      "name": "Unconditional Power",
      "source": "Clone Wars Campaign Guide",
      "cost": "Force Point",
      "description": "When you activate a Force Power that targets only you, you ignore all Condition Track penalties to your Use the Force check to activate that Force Power.",
      "prerequisites": []
    },
    {
      "name": "Holocron Loremaster",
      "source": "Jedi Academy Training Manual",
      "cost": "Force Point or Destiny Point",
      "description": "Whenever you activate a Force Power, you can spend a Force Point to add one use of any Force Power known by any ally within 12 squares of you (whether you know that Force Power or not) to your Force Power Suite. Once used, the Force Power cannot be regained by any means, and if the Force Power is not used by the end of your next turn, it is lost.",
      "alternativeCost": "You can spend a Destiny Point to have the Force Power lost at the end of the encounter instead of the end of your next turn.",
      "prerequisites": [],
      "special": "Additionally, you can enhance any Holocron you possess, adding your knowledge to its memory. You can create a Holocron Gatekeeper in your own image in that Holocron."
    },
    {
      "name": "Mentor",
      "source": "Jedi Academy Training Manual",
      "cost": "Force Point or Destiny Point",
      "description": "Whenever you activate a Force Power, you can spend a Force Point to add one use of that Force Power to the Force Power Suite of one ally within 12 squares of you and in your line of sight. Once used, the Force Power cannot be regained by any means, and if the Force Power is not used by the end of the ally's next turn, it is lost.",
      "alternativeCost": "You or the ally can spend a Destiny Point to have the Force Power lost at the end of the encounter, instead of the end of the ally's next turn.",
      "prerequisites": ["Successfully trained an Apprentice to knighthood (or the equivalent rank for other Force Traditions)"]
    }
  ]
}
