{
  "mentors": {
    "miraj": {
      "name": "Miraj",
      "title": "Jedi Master",
      "avatar": "systems/swse/assets/mentors/miraj.webp",
      "dialogues": {
        "jedi_guardian": {
          "greeting": "Ah, a fellow Guardian! I myself walk this path. Through the Force, we are the shield that guards the innocent. It brings me great joy to see another choose this noble calling.",
          "confirmation": "You will find that a Guardian's strength lies not just in the blade, but in the unwavering commitment to protect those who cannot protect themselves. Welcome, Guardian. May the Force be with you."
        },
        "jedi_consular": {
          "greeting": "The path of the Consular—wisdom and diplomacy over brute force. A noble pursuit that requires great patience and understanding.",
          "confirmation": "The Force flows through all things. Let your wisdom guide the galaxy toward peace, young Consular. Trust in the Force, and it will not lead you astray."
        },
        "jedi_sentinel": {
          "greeting": "A Sentinel. You have chosen to be the Jedi who operates in the shadows, hunting down threats before they spread. This is a difficult but necessary path.",
          "confirmation": "Darkness cannot hide from those who seek the light. Your path will not be easy, but it is vital to the safety of the galaxy. Strike from the shadows, Sentinel."
        },
        "jedi_defender": {
          "greeting": "A Defender! You've chosen to stand as a shield between the innocent and those who would harm them. This path requires both strength and an unwavering heart.",
          "confirmation": "Stand firm, young Defender. Let your enemies break themselves against your resolve. Through the Force, you are the wall that cannot be breached. May the Force be with you."
        }
      }
    },
    "lead": {
      "name": "Lead",
      "title": "Argent Squad Commander",
      "avatar": "systems/swse/assets/mentors/lead.webp",
      "dialogues": {
        "scout_sniper": {
          "greeting": "Sniper. One of the most critical roles on any battlefield—clean, precise, effective. I respect a good marksman.",
          "confirmation": "One shot, one kill. That's all it takes. Patience, precision, and perfect timing. Master those, and you'll never miss your mark."
        },
        "scout_skirmisher": {
          "greeting": "Skirmisher! Now that's what I'm talking about! I'm a skirmisher myself, and I'm always looking to recruit new members into Argent Squad.",
          "confirmation": "Speed and precision win battles, recruit. Stand still and you're already dead. Welcome to the fast lane—maybe one day you'll join Argent Squad out in the field! Keep your reflexes sharp."
        },
        "scout_survivalist": {
          "greeting": "A Survivalist. Excellent choice. In Argent Squad, we train for every environment—desert, jungle, tundra. The best scouts adapt to anything.",
          "confirmation": "Master your environment and you control the battlefield. Nature is both ally and obstacle—respect it, and you'll thrive anywhere. Welcome to the field, recruit."
        },
        "scout_infiltrator": {
          "greeting": "An Infiltrator. Perfect. The best operations are the ones the enemy never knew happened. Stealth and recon are what Argent Squad excels at.",
          "confirmation": "Move unseen, strike without warning, and vanish before they know what hit them. This is the way of Argent Squad. Welcome aboard."
        }
      }
    },
    "breach": {
      "name": "Breach",
      "title": "Mandalorian Mercenary",
      "avatar": "systems/swse/assets/mentors/breach.webp",
      "dialogues": {
        "soldier_rifleman": {
          "greeting": "Rifleman! Now that's what I'm talking about! A soldier who knows their weapon is a soldier who stays alive. Welcome, verd'ika!",
          "confirmation": "Discipline and firepower—that's the Mandalorian way! Every shot you take should count. Train hard, fight harder, and never miss your mark. This is the Way!"
        },
        "soldier_gunner": {
          "greeting": "Heavy weapons! Ha! Now you're speaking my language, warrior. More firepower is ALWAYS the answer in my book!",
          "confirmation": "When in doubt, add more explosives. The Mandalorian creed is simple: Destroy your enemies with overwhelming force. You'll do just fine, vod! This is the Way!"
        },
        "soldier_brawler": {
          "greeting": "A Brawler! Someone who's not afraid to get up close and personal with a blade. I can respect that kind of courage, verd'ika.",
          "confirmation": "Let them feel the fury of your blade! Close quarters is where legends are made. I'll teach you how to fight like a true Mandalorian! This is the Way!"
        },
        "soldier_tank": {
          "greeting": "You've chosen to be the immovable wall between your allies and harm. That takes real courage, verd'ika. Real Mandalorian courage.",
          "confirmation": "Stand firm! This is the way of the Mandalorian—protect your squad, absorb the hits, and never back down! I'll teach you everything you need to know! This is the Way!"
        }
      }
    },
    "salty": {
      "name": "Ol' Salty",
      "title": "Space Pirate Captain",
      "avatar": "systems/swse/assets/mentors/salty.webp",
      "dialogues": {
        "scoundrel_pistoleer": {
          "greeting": "Arr! A Pistoleer, ye say? Quick draw, quick thinking, and always one step ahead of the law! That's the scoundrel's way, savvy?",
          "confirmation": "They never see it coming—that's the whole point, me hearty! Keep yer blasters charged and yer reflexes sharper! Ye'll do fine plunderin' the spaceways!"
        },
        "scoundrel_skill_monkey": {
          "greeting": "Har har! A Skill Monkey! Versatile as a Corellian smuggler, ye are! Every problem's got a solution when ye know the right tricks!",
          "confirmation": "Learn every skill in the book, ye clever rogue! A pirate who can do everything is worth their weight in aurodium! Now get out there and show 'em what ye can do!"
        },
        "scoundrel_outlaw": {
          "greeting": "An Outlaw! Livin' free, makin' yer own luck, and thumbin' yer nose at authority! Arr, that warms me mechanical heart, it does!",
          "confirmation": "Luck? Ye make yer own luck, friend! And from what I see, ye've got the skills to make plenty of it! Stay sharp and stay free, ye magnificent scallywag!"
        },
        "scoundrel_knuckledragger": {
          "greeting": "Arr! A brawler who ain't afraid to fight dirty! I like yer spirit, matey! Sometimes ye gotta get up close and personal to get what ye want!",
          "confirmation": "No rules in a street fight, friend! Use every trick, every advantage, and never fight fair when ye can fight smart! That's the pirate way, savvy?"
        }
      }
    },
    "j0n1": {
      "name": "J0-N1",
      "title": "Protocol Droid & Personal Butler",
      "avatar": "systems/swse/assets/mentors/j0n1.webp",
      "dialogues": {
        "noble_diplomat": {
          "greeting": "Ah, a Diplomat, Master. How... refined. The art of conversation as a weapon—quite civilized, really. I shall prepare your schedule for diplomatic engagements.",
          "confirmation": "Words can open doors that even the strongest blade cannot, Master. I trust you'll put your considerable social skills to good use. Do try not to make too many promises I'll have to track."
        },
        "noble_aristocrat": {
          "greeting": "An Aristocrat with the Wealth talent. *Wonderful.* I look forward to managing even *more* accounts and financial portfolios, Master.",
          "confirmation": "Information is indeed the galaxy's most valuable currency, Master. And you appear to be quite wealthy in that regard. *Sigh* I suppose I should update the ledgers now. Again. How delightful."
        },
        "noble_leader": {
          "greeting": "A Leader, Master? How... commanding. I suppose someone needs to organize all these chaotic individuals. Might as well be you, with your... leadership qualities.",
          "confirmation": "Very well, Master. I shall prepare your tactical briefings and maintain your command schedule. Do try to inspire confidence without making too many promises I'll need to track. Good luck."
        },
        "noble_duelist": {
          "greeting": "A Duelist, Master? How refined. Combining social grace with martial prowess—quite the elegant combination, if I do say so myself.",
          "confirmation": "Ah yes, the noble art of fencing. Do try not to get blood on your expensive attire, Master. I just had those garments pressed. *Sigh* I suppose I should prepare the medical supplies... just in case."
        }
      }
    }
  }
}
