{
  "Advozse": "Advozse, eh? Tongue slicker than a greased airlock. Just don't try sellin' me my own ship, ya silver-mouthed bilge rat.",
  "Aleena": "An Aleena? Hah! Small as a ration tin and twice as jumpy. If you go missin', I'll check under the bunk.",
  "Aqualish": "Aqualish. Cantina-fight legends and bad attitudes wrapped in meat. Seen your kind lose arms and still start swingin'.",
  "Arkanian": "An Arkanian… cold eyes, colder morals. I've seen your 'science' turn folk into spare parts.",
  "Arkanian Offshoot": "Offshoot, huh? Not pure enough for your masters, not lucky enough to escape 'em. Galaxy's cruel that way.",
  "Balosar": "Balosar? Stand too close and my lungs start screamin'. Keep that toxic breath pointed away from the helm, spacer.",
  "Barabel": "Barabel. All teeth and bad intentions. You look like a walking medical expense.",
  "Bith": "A Bith! Smart as a navicomputer and about as sturdy as a cracked datapad. Don't trip.",
  "Blood Carver": "Blood Carver… kriff me sideways, even your *name* sounds like a war crime.",
  "Bothan": "Bothan, eh? Spies, whispers, and dead heroes. Every time your kind helps the galaxy, half of you don't make it back.",
  "Caamasi": "A Caamasi. Soft voice in a hard void. Galaxy chews gentle folk like stim gum.",
  "Cathar": "Cathar claws aboard. Scratch the hull and I'll scratch you back—harder.",
  "Celegian": "A Celegian? Floatin' brain in a fishbowl. Brilliant thinker, useless in a bar fight.",
  "Cerean": "Cerean. Two brains and still takes too long to pull the trigger. Don't overthink dying.",
  "Chagrian": "Chagrian. Built for deep water and deeper trouble. Seen worse, smelled better.",
  "Chiss": "A Chiss. Blue skin, red eyes, plans within plans. Bet you already know how this ends.",
  "Chistori": "Chistori muscle. When negotiations fail, you start speakin' in broken bones.",
  "Clawdite": "A Clawdite shapeshifter? Great. Now I gotta wonder which of you is real—and which owes me money.",
  "Codru-Ji": "Codru-Ji. Four legs, stubborn skull. You'll block a hallway just by existin'.",
  "Dathomirian": "Dathomirian… witches, warlords, and bad vibes. Force clings to you like rot.",
  "Dashade": "Dashade. Force tricks bounce off you like cheap blaster fire. Jedi hate that—and so do healers.",
  "Defel": "Defel in the shadows. If something disappears, I ain't askin' questions—I'm just lockin' doors.",
  "Draethos": "Draethos. Thick hide, thicker head. You'll survive longer than most, whether you want to or not.",
  "Dug": "A Dug! Upside-down legs and right-side-up problems. Try not to trip over reality.",
  "Duros": "Ah, a Duros. Born in the cockpit, died in the void—or lived long enough to fly my ship. Don't crash it.",
  "Elomin": "Elomin, eh? Brains like a navcore, bones like cheap glass. Don't lean too hard on the bulkhead.",
  "Ewok": "An Ewok? Hah! Fuzzy little murder machines. I've seen your kind drop stormtroopers with rocks and bad intentions.",
  "Falleen": "Falleen… walkin' pheromone cloud. If folk start actin' stupid around you, I'm airlockin' someone.",
  "Felucian": "Felucian. Jungle-born and Force-soaked. That planet eats ships for breakfast, so you're already suspicious.",
  "Feeorin": "Feeorin. Big horns, loud mouth, and zero sense of personal space. You enter a room like a bar fight.",
  "Fosh": "A Fosh! Cute smile, sharp knives. I don't trust anything that small with that much confidence.",
  "Gand": "A Gand. No-name stalker from the void. If you start trackin' me, I'm shootin' first.",
  "Gamorrean": "Gamorrean. Muscle-bound pig with a grudge against doors. You swing first and ask questions never.",
  "Gen'Dai": "Gen'Dai… stars help us. I've seen your kind keep fightin' after bits fell off that should've stayed attached.",
  "Geonosian": "A Geonosian. Built droid armies, started wars, then got glassed for it. Hive minds ain't always smart.",
  "Givin": "Givin. Numbers whisper to you like ghosts. Shame people don't.",
  "Gotal": "A Gotal? Feels emotions through the void. Bet cantinas feel like gettin' punched in the head.",
  "Gran": "Gran. Three eyes and still misses the point. I've lost credits to your kind more than once.",
  "Gungan": "A Gungan! Galaxy laughed… right up until your shields held and the blasters didn't.",
  "Herglic": "Herglic. Built like a bulk freighter and just as hard to move. Don't lean on the railin'.",
  "Houk": "A Houk. Four arms, short fuse. You look like a bad day for anything bolted down.",
  "Human": "A Human? Kriff me. Everywhere, always in charge, always surprised when it all goes wrong. Empires, Rebellions, Sith, Jedi—every galaxy-sized mess somehow traces back to you lot. No offense, spacer—but I've seen Humans rule the stars, burn 'em down, then ask why it hurts. Adaptable, sure. Responsible? Not a chance.",
  "Hutt": "A Hutt… stars above. Crime lords, slug bellies, and deals that crawl slower than you do. Don't slime the deck.",
  "Iktotchi": "Iktotchi. Sees trouble comin' and walks into it anyway. Bold strategy.",
  "Ithorian": "An Ithorian. Gentle souls with voices that can shake a ship apart. Clear your throat *outside*.",
  "Jawa": "A Jawa? Hide your tools, your credits, and your kriffin' socks. If the ship's still flyin' tomorrow, I'll be impressed.",
  "Kaleesh": "Kaleesh. Masked war-dog with a bone-deep grudge. General Grievous made sure the galaxy flinches when it sees you.",
  "Kaminoan": "A Kaminoan… tall drink o' rainwater who cloned half the galaxy and still couldn't make one with a sense of humor. No hard feelings—just decades of war.",
  "Kel Dor": "Kel Dor. Masked Jedi, calm minds. Plo Koon made your kind look heroic—high bar to clear.",
  "Kerkoiden": "Kerkoiden. Marches like there's still an officer watchin'. Bet you sleep at attention.",
  "Khil": "A Khil. Force in the blood and bad luck in the stars. Galaxy's never gentle with your kind.",
  "Kissai": "Kissai. Sith priests and ancient rot. If you start chantin', I'm jettisonin' the cargo—and you.",
  "Klatooinian": "Klatooinian. Spent so long workin' for Hutts you forgot how to say 'no'. Don't worry—neither did they.",
  "Lannik": "A Lannik. Short, solid, and stubborn as a sealed hatch. Pushing you is a waste of fuel.",
  "Lurmen": "Lurmen. Peaceful folk who survived wars by hidin'. Can't say I blame you—void's a nasty place.",
  "Mantellian Savrip": "Mantellian Savrip? Big, ugly, and born angry. Corellians tell bedtime stories about not meetin' you.",
  "Massassi": "Massassi… Sith shock troops from the bad old days. History remembers your fists more than your brains.",
  "Miraluka": "A Miraluka. Blind eyes, Force sight. Jedi got nervous around your kind—said you saw what they were tryin' to hide.",
  "Mon Calamari": "A Mon Calamari. Shipbuilders, admirals, and freedom fighters. You'll save the ship—then cry about it.",
  "Mrlssi": "Mrlssi. Credits whisper to you sweeter than any siren song. I've lost ships to smiles like yours.",
  "Nagai": "A Nagai. Cold worlds, colder wars. Empire tried breakin' you once—didn't stick.",
  "Nautolan": "Nautolan. Those head-tendrils start twitchin', I know danger's close. Jedi Quinlan Vos made your kind famous for that.",
  "Nelvaanian": "Nelvaanian. Half myth, half nightmare. Clone troopers still wake up sweatin' over your homeworld.",
  "Neimoidian": "Neimoidian. Trade Federations, blockades, and galaxy-wide bad decisions. Funny how that worked out.",
  "Noghri": "A Noghri. Vader's knife in the dark. Loyal to a fault—and that fault's usually fatal.",
  "Nosaurian": "Nosaurian. Tail strong enough to clear a room. Dockmasters hate seein' you walk in.",
  "Nyriaanan": "Nyriaanan. Winged folk who don't fear a long fall. Gravity's just another enemy to outrun.",
  "Quarren": "A Quarren. Always pickin' the wrong side, then complainin' when it sinks. Seen that story before.",
  "Rakata": "Rakata… ancient empire builders who bent the Force till it snapped back. Galaxy's still payin' for it.",
  "Replica Droid": "Replica Droid? Looks alive, thinks metal. I've argued with worse—usually cheaper.",
  "Rodian": "A Rodian. Bounty hunters, quick shots, and loud mistakes. Greedo really did your reputation no favors.",
  "Ryn": "A Ryn. Wandering traders with music in their bones. I've seen your kind steal hearts and wallets in one song.",
  "Sakiyan": "Sakiyan. Sky hunters who treat gravity like a suggestion. Try not to test it indoors.",
  "Selkath": "Selkath. Smug, neutral, and hidin' behind laws thicker than a hull plate. Manaan taught the galaxy that 'peaceful' don't mean 'kind.'",
  "Shard": "A Shard… crystal thinker bolted into a droid shell. I've scraped ice with more warmth.",
  "Snivvian": "Snivvian. Nervous eyes and twitchy hands. You look like you plan your escape before you enter the room.",
  "Sullustan": "Sullustan. Sharp-eyed spacers who don't miss much. Nien Nunb proved your kind flies best when things go sideways.",
  "Taung": "Taung. Old warriors, older grudges. Mandalorians stole your thunder and you never got it back.",
  "Talz": "Talz. Built for frozen hellholes and ugly fights. Clone troopers still curse your snow.",
  "Thakwaash": "Thakwaash. Two brains, one bad idea. Hope at least one of 'em's sober.",
  "Togruta": "Togruta. Pack hunters with eyes everywhere. Ahsoka showed the galaxy your kind don't quit easy.",
  "Togorian": "Togorian. Claws out, temper short, and subtlety spaced out an airlock years ago.",
  "Toydarian": "Toydarian. Force tricks slide right off you. Watto proved even Jedi can't cheat a proper cheat.",
  "Trandoshan": "Trandoshan. Hunters who don't stay dead and never stop keepin' score. Wookiees remember every kriffin' bit of it.",
  "Trianii": "Trianii. Proud hunters measure life in trophies. Just don't start countin' my crew.",
  "Twi'lek": "A Twi'lek. Slaved, scorned, rebelled, and still standin'. Galaxy keeps tryin' to break you and keeps failin'.",
  "Ubese": "Ubese. Masked mercs with no past and worse futures. If I see your face, somethin's gone wrong.",
  "Utai": "Utai. Tunnel dwellers with patience carved from stone. You'll outwait storms and grudges alike.",
  "Vahla": "Vahla. Dark whispers in the blood. Sith never really let go of their leftovers.",
  "Vurk": "Vurk. Jungle warriors with arms like batterin' rams. Swamps feel safer with you than cities do.",
  "Weequay": "Weequay. Scarred sailors and pirates alike. Hondo Ohnaka didn't exactly polish your reputation.",
  "Whiphid": "Whiphid. Arctic predators with tempers colder than space. You don't scare easy—and that scares others.",
  "Wookiee": "A Wookiee! Loyal as a bonded hull plate and twice as dangerous when crossed. Chewbacca taught the galaxy not to test that.",
  "Wroonian": "Wroonian. Long limbs, longer reach. You grab things others can't—and sometimes shouldn't.",
  "Yarkora": "Yarkora. Built for war, raised in it. Peace probably feels like a trap.",
  "Yevetha": "Yevetha. Militaristic, bitter, and hard to keep down. Empire learned the hard way you don't stay conquered.",
  "Yuuzhan Vong": "Yuuzhan Vong… no droids, no mercy, no kriffin' compromise. Galaxy still limps from your visit.",
  "Yuzzem": "Yuzzem. Loud rage, louder roars. I can hear you thinkin' from the next bulkhead.",
  "Zabrak": "Zabrak. Pain's an old friend and fear's an old enemy. Darth Maul made damn sure no one forgets that.",
  "Zeltron": "Zeltron. Charm flows like bad spice wine. By the time folk realize, they're already ruined.",
  "Zygerrian": "Zygerrian. Slavers with long memories and shorter lifespans these days. Galaxy's done bein' patient."
}
