{
  "Armor Specialist": "You can maximize the benefits of wearing Armor while reducing or eliminating some of its drawbacks.",
  "Awareness": "You are exceptionally good at noticing things and avoiding perilous situations.",
  "Bounty Hunter": "You are among the finest Bounty Hunters in the galaxy, relying on the element of surprise and your hunter's instincts to catch your prey.",
  "Brawler": "You like to get 'up close and personal' with your enemies and engage them in melee combat.",
  "Camouflage": "You learn quickly how to blend in with your environment.",
  "Commando": "You use advanced combat tactics to take down enemies quickly, shield your comrades, and endure whatever challenges are thrown your way.",
  "Dark Side Devotee": "Your powerful negative emotions allow The Dark Side to flow through you, giving you great power.",
  "Duelist": "Through rigorous training and experience, you become one of the greatest swordfighters in the galaxy.",
  "Expert Pilot": "The Ace Pilot relies on finely honed instincts and years of pilot training to outmaneuver and destroy enemy Starships.",
  "Force Adept": "Force Adepts use The Force to survive on fringe worlds, and they often have signature Force Powers that they use particularly well.",
  "Force Item": "You can imbue Weapons and objects with the power of The Force.",
  "Fortune": "Many Scoundrels like to gamble with destiny, putting everything on the line and trusting fate (or The Force) to bring them fortune, fame, and success.",
  "Fringer": "You're especially skilled at 'getting by' on backwater worlds.",
  "Gunner": "Many Starship Gunners are skilled both in and out of the cockpit and are deadly with ranged Weapons of any kind.",
  "Gunslinger": "You never travel anywhere without a blaster (or two), and you know how to handle yourself in a gunfight.",
  "Infamy": "You are wanted in multiple systems for criminal acts; and your manner of doing business has earned you an unsavory reputation in the criminal underworld.",
  "Influence": "One of your greatest strengths is your ability to exert influence over your opponents.",
  "Inspiration": "You can often get results out of their friends, allies, and followers that other leaders cannot.",
  "Jedi Consular": "Jedi that follow the path of the consular are skilled negotiators and talented ambassadors.",
  "Jedi Guardian": "Jedi that follow the path of the guardian are more combat-oriented than other Jedi, honing their skills to become deadly combatants.",
  "Jedi Sentinel": "The Jedi that follow the path of the sentinel are the true enemies of The Dark Side, hunting down evil and stopping the spread of darkness wherever they go.",
  "Leadership": "A born leader, you know how to change and lead your companions and followers to success.",
  "Lightsaber Combat": "The Lightsaber is the chosen weapon of the Jedi. Not as clumsy or random as a blaster, the Lightsaber is an elegant weapon for a more civilized combatant.",
  "Lightsaber Forms": "You have refined your knowledge of Lightsaber technique, your blade becoming an extension of yourself.",
  "Lineage": "You lead a privileged life and reap the benefit of an upbringing beyond most citizens of the galaxy.",
  "Mastermind": "You have the ability to attract loyal minions and are skilled at redirecting allies on the battlefield.",
  "Military Tactics": "You are an expert at leading troops into battle and using the battlefield to your advantage.",
  "Misfortune": "Your mother always said you were trouble. Now your enemies know it, too.",
  "Sith": "The Sith believes in order through tyranny, conspiring to annihilate The Jedi and everything they stand for.",
  "Slicer": "You move like a ghost through The HoloNet and can hack into enemy mainframes and computer systems with astonishing grace.",
  "Spacer": "You pron the space lanes seeking wealth, fame, adventure, or something more. You're also pretty good with Vehicles in general.",
  "Survivor": "As an explorer of dangerous places, you are trained to react to danger swiftly and adroitly, as well as navigate difficult terrain and reduce damage.",
  "Weapon Master": "You are skilled at wielding a variety of weapons and can wield choice Weapons with deadly precision and force.",
  "Weapon Specialist": "You are highly trained at using specific weapons.",
  "Naval Officer": "You are skilled at commanding Starships and small fleets.",
  "Outlaw Tech": "Scoundrels learn a variety of tricks that allow them to squeeze more life out of ailing technology, enhancing their gear in ways the manufacturer never intended.",
  "Squadron Leader": "You are an expert at leading a squadron of smaller Vehicles into combat as a unit.",
  "Malkite Poisoner": "You can employ a wide array of lethal toxins with which you can quickly and efficiently destroy your targets.",
  "Master of Ter채s K채si": "Ter채s K채si is a powerful and deadly martial arts form that enables its wielder to deal devastating amounts of Unarmed damage.",
  "Corporate Power": "You are an extension of your corporation and wield their power as your own.",
  "Fencing": "In the days of The Old Republic, a particular style arose mixing martial precision with forceful panache.",
  "Gladiatorial Combat": "You have learned the tricks of fighting in the gladiatorial arena, using a specialized combination of combat and showmanship.",
  "Hyperspace Explorer": "You are an experienced deep-space explorer who has learned a few tricks along the way that help you survive both in space and planet-side.",
  "Jedi Battlemaster": "Jedi Battlemasters are highly trained in Jedi combat techniques, serving combat trainers for Jedi Organizations and as Jedi commanders on the battlefield.",
  "Jedi Shadow": "Jedi Shadows are often elite Jedi Sentinels who specialize in abilities that aid them in pursuing Dark Side users in all forms and locations.",
  "Jedi Watchman": "Jedi Watchmen are elite Jedi tasked with protecting and watching over a specific world or region of space; many beginning as Jedi Consulars.",
  "Mandalorian Warrior": "The Mandalorians are talented and ferocious warriors. Their skillful training, warrior culture, and advanced combat abilities make them formidable foes.",
  "Melee Duelist": "You are lethal when fighting with one or more melee Weapons.",
  "Rocket Jumper": "You are an expert in the use of Jet Packs. You can use this form of transport to perform specialized aerial assaults and maneuvers.",
  "Run and Gun": "Scoundrels find ways to slip through fights of any size, even when the odds are against them.",
  "Advanced Medicine": "You are highly trained in medical procedures for all conditions.",
  "Autonomy": "You are able to resist any attempts to curb your independence and can fight back against anyone that tries to suppress your personality.",
  "Bothan SpyNet": "You are trained to work within the famed Bothan SpyNet.",
  "Critical Master": "Some Elite Troopers know exactly where to strike their foes to deal maximum damage, potentially crippling their enemies in the process.",
  "Enforcement": "You are a trained investigator who can locate and apprehend a quarry with exceptional speed and prowess.",
  "Ideologue": "Your zeal and dedication to your cause is inspirational. It motivates your allies and demoralizes your enemies.",
  "Imperial Inquisitor": "Trained to hunt down and destroy the remaining Jedi whenever they are found, Imperial Inquisitors are steeped in the lore of The Dark Side.",
  "Infiltration": "You are trained to secretly infiltrate enemy strongholds and organizations by force or by guile.",
  "Mercenary": "Mercenaries are blasters-for-hire who sell their services to the highest bidder. Few types of Soldiers are more capable of operating independently.",
  "Privateer": "You are a veteran of privateering and have learned the secrets of fighting aboard Starships.",
  "Sabotage": "You are skilled at improvising Weapons, handling Explosives, and disrupting the enemy.",
  "Smuggling": "Smuggling is part skill, part talent, part luck. The most notorious smugglers in the galaxy get along by making use of their quick wits and savvy.",
  "Specialized Droid": "You have become more specialized than other Droids of the same or a similar model.",
  "Spy": "Scouts are often capable of getting into areas unseen, and they make excellent spies thanks to their survival instincts and aptitude for stealth.",
  "Turret": "You can construct small, disposable, automated turrets.",
  "Assassin": "If ever caught in a straightforward fight, the odds are you are not going to make it, so your best move is to fight dirty and use every trick at your disposal.",
  "Blockade Runner": "One of the most valued skills a pilot on the fringe can have is the ability to blast past the authorities and not get caught.",
  "Disgrace": "Scandal fouls your family name, forcing you to live among the fringes of society and teaching you that honor is overrated when victory is on the line.",
  "Gand Findsman": "The Gand Findsmen are an ancient order of Force-sensitive Bounty Hunters that interpret signs and portents.",
  "GenoHaradan": "Members of The GenoHaradan are skilled not only in performing assassinations but also in manipulating others.",
  "Outlaw": "As an Outlaw, you live under a shadow, and everywhere you go, any time you reveal yourself, you risk being noticed and captured.",
  "Piracy": "You use devious tactics to capture ships and victims intact.",
  "Pistoleer": "You are a master of wielding two Pistols at the same time, and can use both Pistols simultaneously in unusual ways.",
  "Trickery": "Charlatans are masters of misdirection, confusion, and trickery.",
  "Collaborator": "Some Nobles learn to work both sides of the conflict in war and can manipulate their enemies into believing they are allies.",
  "Droid Commander": "You have learned the quirks and intricacies of commanding Droids, and you can get the most out of even the least sophisticated basic programming.",
  "Jedi Archivist": "You have dedicated your life as a Jedi to preserving knowledge and applying it in times when it is needed.",
  "Jedi Healer": "You have focused your natural ability with The Force to heal the sick and injured.",
  "Loyal Protector": "As a result of your station, occupation, or even just your natural charisma, you can attract one or more faithful Followers who protect you from harm.",
  "Melee Specialist": "Your skill with hand-to-hand combat is unmatched, and you can wield weapons with lethal accuracy and power.",
  "Military Engineer": "You have become skilled at using and manipulating technology on the battlefield. In fact, your fellows rely on your technical expertise in the heat of battle.",
  "Opportunist": "Profiteers, gunrunners, and privateers can use the chaos of war to make a tidy profit, and you are no exception.",
  "Reconnaissance": "You have learned to work well in concert with a team to provide the best reconnaissance and cover as much ground as possible.",
  "Republic Commando": "You have demonstrated that you are a highly skilled and capable soldier for the Republic and work well in a commando squad.",
  "Squad Leader": "You are a capable military leader who can issue orders to a squad of soldiers with poise and efficiency.",
  "Surveillance": "You have mastered the art of surveillance, transforming the information you gather with scouting into a distinct advantage on the battlefield.",
  "Trooper": "In war, soldiers stand side by side against deadly foes, and you have learned how to keep yourself and your comrades alive in battle.",
  "Vanguard": "As an expert in the art of scouting enemy formations, you are a valuable asset to any military force.",
  "Brute Squad": "Your brutal fighting techniques give you an upper hand when operating in small groups.",
  "Carbineer": "Many gunslingers choose to specialize in long arms, especially Blaster Carbines.",
  "Force Hunter": "Hunting Jedi is big business during The Legacy Era, and are among the most dangerous prey for Bounty Hunters to pursue.",
  "Fugitive Commander": "When a fighting force is outmanned, outgunned, and constantly on the run, only the skill and acumen of talented officers can keep prevent defeat.",
  "Implant": "Some Shapers develop implants that can be placed quickly and easily, temporarily boosting the physical prowess of their beneficiaries.",
  "Jedi Refugee": "In The Legacy Era, The Jedi are once again hunted to near-extinction and must learn to conceal their Force Powers and blend in.",
  "Knight's Armor": "You are a skilled master of The Force who knows how to get the most out of your Armor.",
  "Knight's Resolve": "You have dedicated your life to serving the rightful Emperor, and your devotion knows no bounds.",
  "Protection": "You are specially trained to protect those around you, either by taking the brunt of attacks that are aimed at them, or by defusing dangerous situations.",
  "Provocateur": "As a provocateur, you specialize in turning your enemies against one another, giving your allies the advantage through careful use of deception.",
  "Shaper": "You manipulate Yuuzhan Vong Biotech in new ways, molding it to your own ends and making it more effective.",
  "Sith Commander": "The Sith use terror to lead their troops, and Sith commanders have few compunctions about making examples of underlings.",
  "Versatility": "You are known for your ability to adapt to any situation, heedless of adversity.",
  "Yuuzhan Vong Biotech": "Yuuzhan Vong Biotechnology remains available in some parts of the galaxy, although its legally dubious. You have become specialized in its manipulation.",
  "Beastwarden": "You have learned to use The Force to touch the minds of the Beasts, soothing them and convincing them to do your bidding.",
  "Jedi Artisan": "You have dedicated yourself to the art of creation, learning how to craft Weapons and other items used by the Jedi with exquisite detail.",
  "Jedi Instructor": "The role of teacher is vital to the success and strength of The Jedi Order, and you excel at the art of instruction.",
  "Jedi Investigator": "You are one of The Jedi Order's most trusted investigators, tasked with ferreting out truth through a combination of detective work and Force divination.",
  "Jedi Weapon Master": "You have learned to use The Force to master a variety of weapons, and have expanded your martial prowess to cover more than just Lightsabers.",
  "Mystic": "You have studied The Force in a radically different way from other Force-users, relying on rituals and mystic lore to harness its power.",
  "Sith Alchemy": "You have learned the alchemical arts of the ancient Sith Lords and can fill objects and creatures with the power of The Dark Side.",
  "Telepath": "You have mastered the art of mental manipulation, using The Force to touch, read, and affect the minds of others with ease.",
  "Ambusher": "You specialize in springing ambushes on your enemies.",
  "Gambling Leader": "You aren't afraid to take chances when leading your allies, and you risk defeat in exchange for a shot at even the most unlikely victories.",
  "Improviser": "You can build what you need on the fly, and sometimes your customized gear proves more useful than what you otherwise might have purchased.",
  "Pathfinder": "You specialize in finding and creating optimal locations from which your allies can fight, and then making sure that they reach those locales safely.",
  "Procurement": "You know how to find just what you need, no matter how far you are from civilization or how rare the item is.",
  "Rebel Recruiter": "You have learned that many enemies can be considered potential allies instead, recognizing the telltale signs of a potential ally.",
  "Recklessness": "Others call you reckless, but you know that great rewards come only from taking chances, even if they could be deadly.",
  "Unpredictable": "You make it difficult for enemies to harm you because you're never in the place where they expect you to be.",
  "Wingman": "You are adept at flying in tight formations with your allies, working together with them to achieve your goals and using your Vehicle to shield others from harm.",
  "Advance Patrol": "Your skills at observation and stealth are frequently called upon as you gather information about enemy forces.",
  "Anticipation": "You have studied the ways of your enemies and have learned how to read the actions and thoughts of others, anticipating their every move.",
  "Brigand": "You use your experience operating on the wrong side of the law to give you an advantage in a fight, fair or otherwise.",
  "Martial Arts Forms": "You have advanced training in one or more martial art forms, turning your body into a lethal weapon.",
  "Sharpshooter": "You are an expert at long-range combat, using the inherent advantage of a Rifle to win the day.",
  "Shockboxer": "You are trained in the Shockboxing fighting style and can use your fists to devastate your enemies.",
  "Unarmed Mastery": "You have advanced training in one or more martial art form and have turned your body into a lethal weapon.",
  "Veteran": "You have been from one side of the galaxy to the other and have fought on more planets than most people visit in a lifetime.",
  "Elite Droid": "You have become a highly advanced Droid and are among the elite units of your class.",
  "Override": "You can take direct control over your Droid allies for brief periods.",
  "Espionage": "You use your knowledge of stealth and survival to make yourself a master of espionage and a valuable resource for those who wish to keep their hands clean.",
  "Master of Intrigue": "You are a skilled manipulator and have mastered the art of working behind the scenes to accomplish your goals.",
  "Revolutionary": "You seek to overthrow the system and are adept at being a monkey wrench in the cogs of society, but often at the cost of others' rights, freedoms, and lives.",
  "Skill Challenge": "You excel at complex tasks and are always called upon when your allies need something done quickly and done right.",
  "Superior Skills": "You're not just good at what you do, you're the best. Failure is but a stumbling block, and great success always follows.",
  "Exile": "You have broken with your family, world, or organization, adapting in new ways to the galaxy at large.",
  "Master Scout": "You are more experienced and talented than the average Scout. You draw upon your diverse abilities to gain advantages others cannot match.",
  "Mobile Scout": "Always mobile, Scouts have developed ways to ride and drive over all types of terrain.",
  "Outsider": "By blurring the line between lawful and lawless, Scoundrels operate outside social and cultural norms, learning to make the most of their positions.",
  "Warrior": "Warriors draw upon their natural aggressiveness, powerful bodies, and fighting abilities to defeat their enemies."
}
